<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"7f6f951a3088f64cc76f2de4b4d71ddd2ab89d86ba9d33d778d990483a2b1e12","plan_job_ref":"Job PR Plan #1 at https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11720946369","plan_out_hash":"6a6859e293c700396c1dc59480077b8d0f2a29baadb5c2b8504b90d2041d2282","plan_hash":"cd7134794406f37eac3749d56827975addb9859166cb6ab39b69defaa3294a88","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.foo will be created
+   resource "local_file" "foo" {
+       content              = "foo!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./foo.bar"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   example_output_homedir = false
```
</details>

:white_check_mark: Plan applied in [Push Apply #1](https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11720981191)
<details open><summary>Outputs</summary>

```hcl
example_output_homedir = false
```
</details>